pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_block_representation.cpp
const C_galgas_type_descriptor * GALGAS_ipic_31__38_InstructionWithNoOperand::staticTypeDescriptor (void) const {
  return & kTypeDescriptor_GALGAS_ipic_31__38_InstructionWithNoOperand ;
}

//---------------------------------------------------------------------------*

AC_GALGAS_root * GALGAS_ipic_31__38_InstructionWithNoOperand::clonedObject (void) const {
  AC_GALGAS_root * result = NULL ;
  if (isValid ()) {
    macroMyNew (result, GALGAS_ipic_31__38_InstructionWithNoOperand (*this)) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_ipic_31__38_InstructionWithNoOperand GALGAS_ipic_31__38_InstructionWithNoOperand::extractObject (const GALGAS_object & inObject,
                                                                                                        C_Compiler * inCompiler
                                                                                                        COMMA_LOCATION_ARGS) {
  GALGAS_ipic_31__38_InstructionWithNoOperand result ;
  const GALGAS_ipic_31__38_InstructionWithNoOperand * p = (const GALGAS_ipic_31__38_InstructionWithNoOperand *) inObject.embeddedObject () ;
  if (NULL != p) {
    if (NULL != dynamic_cast <const GALGAS_ipic_31__38_InstructionWithNoOperand *> (p)) {
      result = *p ;
    }else{
      inCompiler->castError ("ipic18InstructionWithNoOperand", p->dynamicTypeDescriptor () COMMA_THERE) ;
    }  
  }
  return result ;
}

//---------------------------------------------------------------------------*

GALGAS_ipic_31__38_Block::GALGAS_ipic_31__38_Block (void) :
mAttribute_mLabel (),
mAttribute_mInstructionList (),
mAttribute_mTerminator () {
}

//---------------------------------------------------------------------------*

GALGAS_ipic_31__38_Block::~ GALGAS_ipic_31__38_Block (void) {
}

//---------------------------------------------------------------------------*

GALGAS_ipic_31__38_Block::GALGAS_ipic_31__38_Block (const GALGAS_lstring & inOperand0,
                                                    const GALGAS_ipic_31__38_SequentialInstructionList & inOperand1,
                                                    const GALGAS_ipic_31__38_AbstractBlockTerminator & inOperand2) :
mAttribute_mLabel (inOperand0),
mAttribute_mInstructionList (inOperand1),
mAttribute_mTerminator (inOperand2) {
}

//---------------------------------------------------------------------------*

GALGAS_ipic_31__38_Block GALGAS_ipic_31__38_Block::constructor_new (const GALGAS_lstring & inOperand0,
                                                                    const GALGAS_ipic_31__38_SequentialInstructionList & inOperand1,
                                                                    const GALGAS_ipic_31__38_AbstractBlockTerminator & inOperand2 
                                                                    COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_ipic_31__38_Block result ;
  if (inOperand0.isValid () && inOperand1.isValid () && inOperand2.isValid ()) {
    result = GALGAS_ipic_31__38_Block (inOperand0, inOperand1, inOperand2) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

typeComparisonResult GALGAS_ipic_31__38_Block::objectCompare (const GALGAS_ipic_31__38_Block & inOperand) const {
   typeComparisonResult result = kOperandEqual ;
  if (result == kOperandEqual) {
    result = mAttribute_mLabel.objectCompare (inOperand.mAttribute_mLabel) ;
  }
  if (result == kOperandEqual) {
    result = mAttribute_mInstructionList.objectCompare (inOperand.mAttribute_mInstructionList) ;
  }
  if (result == kOperandEqual) {
    result = mAttribute_mTerminator.objectCompare (inOperand.mAttribute_mTerminator) ;
  }
  return result ;
}

//---------------------------------------------------------------------------*

bool GALGAS_ipic_31__38_Block::isValid (void) const {
  return mAttribute_mLabel.isValid () && mAttribute_mInstructionList.isValid () && mAttribute_mTerminator.isValid () ;
}

//---------------------------------------------------------------------------*

void GALGAS_ipic_31__38_Block::drop (void) {
  mAttribute_mLabel.drop () ;
  mAttribute_mInstructionList.drop () ;
  mAttribute_mTerminator.drop () ;
}

//---------------------------------------------------------------------------*

void GALGAS_ipic_31__38_Block::description (C_String & ioString,
                                            const PMSInt32 inIndentation) const {
  ioString << "<struct @ipic18Block:" ;
  if (! isValid ()) {
    ioString << " not built" ;
  }else{
    mAttribute_mLabel.description (ioString, inIndentation+1) ;
    ioString << ", " ;
    mAttribute_mInstructionList.description (ioString, inIndentation+1) ;
    ioString << ", " ;
    mAttribute_mTerminator.description (ioString, inIndentation+1) ;
  }
  ioString << ">" ;
}

//---------------------------------------------------------------------------*

GALGAS_lstring GALGAS_ipic_31__38_Block::reader_mLabel (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mLabel ;
}

//---------------------------------------------------------------------------*

GALGAS_ipic_31__38_SequentialInstructionList GALGAS_ipic_31__38_Block::reader_mInstructionList (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mInstructionList ;
}

//---------------------------------------------------------------------------*

GALGAS_ipic_31__38_AbstractBlockTerminator GALGAS_ipic_31__38_Block::reader_mTerminator (UNUSED_LOCATION_ARGS) const {
  return mAttribute_mTerminator ;
}



//---------------------------------------------------------------------------*
//                                                                           *
//                             @ipic18Block type                             *
//                                                                           *
//---------------------------------------------------------------------------*

const C_galgas_type_descriptor
kTypeDescriptor_GALGAS_ipic_31__38_Block ("ipic18Block",
                                          NULL) ;

//---------------------------------------------------------------------------*

